{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_1", "batch_input_shape": [null, 150, 150, 3], "use_bias": true, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 32, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 64, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "units": 64, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_constraint": null, "name": "dense_2", "activity_regularizer": null, "units": 1, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "sigmoid"}}]}}