{"config": {"layers": [{"config": {"activity_regularizer": null, "batch_input_shape": [null, 150, 150, 3], "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "filters": 32, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "name": "conv2d_1", "use_bias": true, "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "filters": 32, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "use_bias": true, "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "filters": 64, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "use_bias": true, "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "activation": "linear", "units": 64, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"seed": null, "rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_2", "use_bias": true, "activation": "linear", "units": 1, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}