{"keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["dense_4", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, null, null, 3]}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1_pad", "class_name": "ZeroPadding2D", "config": {"trainable": false, "padding": [[0, 1], [0, 1]], "name": "conv1_pad", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "name": "conv1", "class_name": "Conv2D", "config": {"strides": [2, 2], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 32, "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "name": "conv1", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "conv1_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "name": "conv1_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "name": "conv1_relu", "class_name": "ReLU", "config": {"trainable": false, "threshold": 0.0, "name": "conv1_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "name": "conv_dw_1", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_regularizer": null, "trainable": false, "name": "conv_dw_1", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "name": "conv_dw_1_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "name": "conv_dw_1_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "name": "conv_dw_1_relu", "class_name": "ReLU", "config": {"trainable": false, "threshold": 0.0, "name": "conv_dw_1_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "name": "conv_pw_1", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "kernel_regularizer": null, "kernel_size": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv_pw_1", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "name": "conv_pw_1_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "name": "conv_pw_1_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "name": "conv_pw_1_relu", "class_name": "ReLU", "config": {"trainable": false, "threshold": 0.0, "name": "conv_pw_1_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "name": "conv_pad_2", "class_name": "ZeroPadding2D", "config": {"trainable": false, "padding": [[0, 1], [0, 1]], "name": "conv_pad_2", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "name": "conv_dw_2", "class_name": "DepthwiseConv2D", "config": {"strides": [2, 2], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "depth_multiplier": 1, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_regularizer": null, "trainable": false, "name": "conv_dw_2", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "name": "conv_dw_2_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "name": "conv_dw_2_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "name": "conv_dw_2_relu", "class_name": "ReLU", "config": {"trainable": false, "threshold": 0.0, "name": "conv_dw_2_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "name": "conv_pw_2", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 128, "kernel_regularizer": null, "kernel_size": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv_pw_2", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "name": "conv_pw_2_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "name": "conv_pw_2_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "name": "conv_pw_2_relu", "class_name": "ReLU", "config": {"trainable": false, "threshold": 0.0, "name": "conv_pw_2_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "name": "conv_dw_3", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_regularizer": null, "trainable": false, "name": "conv_dw_3", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "name": "conv_dw_3_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "name": "conv_dw_3_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "name": "conv_dw_3_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_dw_3_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "name": "conv_pw_3", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 128, "kernel_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv_pw_3", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "name": "conv_pw_3_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_pw_3_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "name": "conv_pw_3_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_pw_3_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "name": "conv_pad_4", "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[0, 1], [0, 1]], "name": "conv_pad_4", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "name": "conv_dw_4", "class_name": "DepthwiseConv2D", "config": {"strides": [2, 2], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "depth_multiplier": 1, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "name": "conv_dw_4", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "name": "conv_dw_4_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_dw_4_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "name": "conv_dw_4_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_dw_4_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "name": "conv_pw_4", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 256, "kernel_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv_pw_4", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "name": "conv_pw_4_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_pw_4_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "name": "conv_pw_4_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_pw_4_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "name": "conv_dw_5", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "name": "conv_dw_5", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "name": "conv_dw_5_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_dw_5_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "name": "conv_dw_5_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_dw_5_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "name": "conv_pw_5", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 256, "kernel_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv_pw_5", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "name": "conv_pw_5_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_pw_5_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "name": "conv_pw_5_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_pw_5_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "name": "conv_pad_6", "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[0, 1], [0, 1]], "name": "conv_pad_6", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "name": "conv_dw_6", "class_name": "DepthwiseConv2D", "config": {"strides": [2, 2], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "depth_multiplier": 1, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "name": "conv_dw_6", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "name": "conv_dw_6_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_dw_6_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "name": "conv_dw_6_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_dw_6_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "name": "conv_pw_6", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 512, "kernel_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv_pw_6", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "name": "conv_pw_6_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_pw_6_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "name": "conv_pw_6_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_pw_6_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "name": "conv_dw_7", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "name": "conv_dw_7", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "name": "conv_dw_7_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_dw_7_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "name": "conv_dw_7_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_dw_7_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "name": "conv_pw_7", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 512, "kernel_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv_pw_7", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "name": "conv_pw_7_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_pw_7_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "name": "conv_pw_7_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_pw_7_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "name": "conv_dw_8", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "name": "conv_dw_8", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "name": "conv_dw_8_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_dw_8_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "name": "conv_dw_8_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_dw_8_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "name": "conv_pw_8", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 512, "kernel_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv_pw_8", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "name": "conv_pw_8_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_pw_8_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "name": "conv_pw_8_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_pw_8_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "name": "conv_dw_9", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "name": "conv_dw_9", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "name": "conv_dw_9_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_dw_9_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "name": "conv_dw_9_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_dw_9_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "name": "conv_pw_9", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 512, "kernel_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv_pw_9", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "name": "conv_pw_9_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_pw_9_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "name": "conv_pw_9_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_pw_9_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "name": "conv_dw_10", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "name": "conv_dw_10", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "name": "conv_dw_10_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_dw_10_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "name": "conv_dw_10_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_dw_10_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "name": "conv_pw_10", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 512, "kernel_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv_pw_10", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "name": "conv_pw_10_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_pw_10_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "name": "conv_pw_10_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_pw_10_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "name": "conv_dw_11", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "name": "conv_dw_11", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "name": "conv_dw_11_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_dw_11_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "name": "conv_dw_11_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_dw_11_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "name": "conv_pw_11", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 512, "kernel_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv_pw_11", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "name": "conv_pw_11_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_pw_11_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "name": "conv_pw_11_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_pw_11_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "name": "conv_pad_12", "class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[0, 1], [0, 1]], "name": "conv_pad_12", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "name": "conv_dw_12", "class_name": "DepthwiseConv2D", "config": {"strides": [2, 2], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "depth_multiplier": 1, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "name": "conv_dw_12", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "name": "conv_dw_12_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_dw_12_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "name": "conv_dw_12_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_dw_12_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "name": "conv_pw_12", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 1024, "kernel_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv_pw_12", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "name": "conv_pw_12_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_pw_12_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "name": "conv_pw_12_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_pw_12_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "name": "conv_dw_13", "class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "name": "conv_dw_13", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "name": "conv_dw_13_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_dw_13_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "name": "conv_dw_13_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_dw_13_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "name": "conv_pw_13", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 1024, "kernel_regularizer": null, "kernel_size": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv_pw_13", "data_format": "channels_last", "activity_regularizer": null}}, {"inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "name": "conv_pw_13_bn", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "conv_pw_13_bn", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "name": "conv_pw_13_relu", "class_name": "ReLU", "config": {"trainable": true, "threshold": 0.0, "name": "conv_pw_13_relu", "max_value": 6.0, "negative_slope": 0.0}}, {"inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}}, {"inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"activation": "relu", "bias_constraint": null, "use_bias": true, "units": 1024, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "trainable": true, "name": "dense_1"}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense", "config": {"activation": "relu", "bias_constraint": null, "use_bias": true, "units": 1024, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "trainable": true, "name": "dense_2"}}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense", "config": {"activation": "relu", "bias_constraint": null, "use_bias": true, "units": 512, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "trainable": true, "name": "dense_3"}}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dense_4", "class_name": "Dense", "config": {"activation": "softmax", "bias_constraint": null, "use_bias": true, "units": 4, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "trainable": true, "name": "dense_4"}}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}