{"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "activation": "linear", "name": "conv2d_1", "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "filters": 32, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 150, 150, 3]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_2", "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "filters": 32, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_3", "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "filters": 64, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "linear", "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "units": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "rate": 0.5, "seed": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activation": "linear", "name": "dense_2", "kernel_regularizer": null, "use_bias": true, "units": 1, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_5"}}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.2.4"}